{
  "pages": {
    "manifesto": {
      "id": "00",
      "slug": "manifesto",
      "title": "I help creative teams build systems that hold their vision through real constraint.",
      "type": "manifesto",
      "layout": "about-page",
      "navigation": true,
      "order": 0,
      "content": "## WHO I AM\n\nI'm a systems architect trained in Visual Communication at SVA and hardened on construction sites. I don't separate design from engineering, intent from execution, or vision from the infrastructure that has to hold it.\n\nI build systems from first principles. Not as a response to crisis. As a deliberate choice.\n\n## WHAT I DO\n\nI help creative teams ensure their vision survives deployment.\n\nCreative work dies in two ways: abandoned before it's finished, or compromised when it hits real constraint. I prevent both. I work with designers, founders, makers, artists—anyone with a coherent vision that needs to survive contact with technical reality, organizational complexity, or scale.\n\nThe work is always the same: clarify the vision. Identify where it fragments under pressure. Build the narrative, visual, and technical systems that hold it together.\n\n## THREE INTEGRATED SYSTEMS\n\n**Narrative Systems** — Strategic positioning and world-building encoded into operations. Brand stories that don't fracture across touchpoints. I build **Narrative Solvency**: the infrastructure ensuring your story survives deployment. See: Aiden Jae (luxury positioning into e-commerce mechanics), Altrueism (philanthropic transparency as operational logic), New City (thematic integration into game mechanics).\n\n**Visual Systems** — Identity, typography, design logic that doesn't ossify or become arbitrary. Swiss grid thinking applied to platforms, brands, archives. I treat visual form as load-bearing structure. See: Encore (design system holding 12 years), Everyday Gold (regulatory constraints as design material), The Deep Cuts (typographic hierarchy as information density).\n\n**Technical Systems** — Engineering and infrastructure reliable enough that creative work can happen on top. Platforms that survive their creators. Code that respects intent. See: Encore (99.9% uptime, 12 years), Savepoint Protocol (cognitive governance), Portable Agency (local infrastructure that works offline).\n\nMost significant projects require all three working together. That integration is where most teams fail. That's where I focus.\n\n## WHO I'M FOR\n\n**Creative teams** that have a clear vision but can't translate it into systems that actually hold. Designers and engineers working at cross-purposes. Brands that feel incoherent across touchpoints. Founders whose operational reality contradicts their positioning.\n\n**People building for constraint**—neurodivergent households, teams with limited resources, organizations where willpower-dependent processes fail. I build systems that run on structure, not heroics.\n\n**Anyone who believes** that the difference between work that lasts and work that breaks is structural, not magical.\n\n## WHAT MAKES ME DIFFERENT\n\n**1. I integrate, not layer.** Most teams treat narrative, visual, and technical as separate tracks. I design them as one system. The brand story informs the UX logic. The visual constraint shapes the component library. The technical infrastructure enables the narrative. When this works, the result is granular fidelity—the idea and the infrastructure are the same thing.\n\n**2. I work from first principles, not reactively.** I don't diagnose broken systems and patch them. I ask: what should actually be built here? Then I build it to last. See: Protocols tier. Four frameworks designed because existing tools failed. Savepoint survives 12 years and two complete technological shifts. Order of the Ætherwright stays coherent as a team scales.\n\n**3. I have proof the methodology works everywhere.** Applied Systems shows the same approach deployed at enterprise scale (Encore), on luxury e-commerce (Aiden Jae), in household operations (Modernist Homestead), on brand rebrands (Altrueism). Same diagnostic approach. Works every time. Not theory. Practice under real pressure.\n\n**4. I treat constraints as design material.** Regulatory limits. Format restrictions. Neurodivergent executive function needs. Budget constraints. Most people see these as problems. I see them as the forcing function that concentrates meaning. Constraint is where coherence happens.\n\n**5. I build systems that survive their tools.** Savepoint works on paper or in AI. Order of the Ætherwright doesn't depend on a website. Portable Agency works when the internet doesn't. Systems should be portable enough to survive their creators. That durability is the real test.\n\n## THE PROOF\n\n**Protocols** — Original frameworks designed from first principles because existing tools failed.\n\n**Applied Systems** — Same methodology deployed at enterprise scale, on luxury brands, in household systems, on rebrands. Proof the approach works everywhere.\n\n**Practice** — Active research stress-testing principles across domains: narrative systems, visual constraints, signal flow protocols, typographic automation. The principles hold. They scale. They're portable.\n\n12 years at 99.9% uptime isn't a portfolio highlight. It's structural proof. A neurodivergent household running on systems instead of willpower is proof. A brand that stays coherent through organizational complexity is proof.\n\nThe work is the test. The systems that survive are the answer."
    },
    "provenance": {
      "id": "01",
      "slug": "provenance",
      "title": "Provenance: How This Practice Developed",
      "type": "page",
      "layout": "about-page",
      "navigation": true,
      "order": 1,
      "content": "# The Apprenticeship\n\n## Construction Sites\n\nI started on job sites. My father built things — framing, concrete, finish work. Before I understood design theory or information architecture, I understood load paths. I understood that a structure either holds or it doesn't, and the difference is in the joints.\n\nThat's still how I think about systems. The interesting question is never \"what should this look like?\" It's \"where does this fail?\"\n\n## SVA and Print Shops\n\nI went to the School of Visual Arts in New York. Studied graphic design — not the Photoshop-and-portfolios version, but the Swiss-grid, typographic-hierarchy, information-density version. Learned to think about visual systems as structural systems. Learned that typography is load-bearing.\n\nBetween classes, I worked in print shops. Offset presses. Prepress production. The kind of work where a misaligned registration mark wastes a thousand sheets of paper. Precision wasn't a value — it was a material constraint.\n\n## Visual Communication as Foundation\n\nBefore systems architecture, before front-end engineering, before protocols — typography.\n\nAt SVA, I didn't learn \"graphic design\" as decoration. I learned Visual Communication as structural discipline. Swiss grid systems. Typographic hierarchy as information architecture. Josef Müller-Brockmann, Massimo Vignelli, Emil Ruder. The discipline that treats visual form as load-bearing structure.\n\nThis isn't nostalgia. It's the foundation everything else sits on. You can't build durable interfaces without understanding typographic hierarchy. You can't architect brand systems without understanding visual grammar. You can't design information systems without understanding how the eye parses density.\n\nVisual Communication is the chassis. The output channels through three systems: Narrative (brand story and world-building), Visual (identity and typography), and Technical (engineering and infrastructure). The discipline stays constant. The outputs change based on context.\n\n## Twelve Years at Cluen\n\nAfter New York, I became the Principal Architect at Cluen Corporation. The Encore Platform — a recruitment management system serving 40,000+ users across Fortune 500 companies and federal agencies.\n\nTwelve years is a long time to stay with one system. Long enough to see three technological epochs come and go. Long enough to learn that the hard part isn't building something — it's keeping it alive while everything around it changes.\n\nI didn't do a big rewrite. I wrapped legacy .NET infrastructure in modern React interfaces. Replaced the engine while the car was moving. The Strangler Fig pattern — not because it's fashionable, but because it respects institutional knowledge and uptime.\n\n99.9% uptime over 12 years. Zero catastrophic failures. 2.5 million annual transactions. That's not a portfolio piece. That's a structural proof.\n\n## The Neurodivergent Household\n\nMy family runs on systems because it has to. ADHD, autism, and executive function challenges across the household mean that willpower-dependent processes fail. If breakfast prep takes 90 minutes of decision-making, the family doesn't eat.\n\nSo I built systems. Savepoint Protocol started here — documenting moments of stability so you can return to them when things drift. The Modernist Homestead started here — zero-willpower household systems where structural defaults replace decision fatigue. Culinary modularity across five traditions. Celiac health navigation. Executive function scaffolding. The family operates on structure, not willpower.\n\nThese aren't side projects. They're the same structural discipline applied to a different domain. A system either holds under load or it doesn't. The domain is irrelevant. The engineering is the same.\n\n## The Unified Practice\n\nWhat connects construction sites and code architecture, print shops and protocol design, enterprise platforms and family meal systems:\n\nEvery one of these is a problem of structural integrity. Of building something that holds up under pressure, over time, when the people operating it are tired or distracted or new to the job.\n\nI don't draw a line between professional and personal work. The systems I build for clients use the same principles I developed to keep my household running. The voice protocol I use to write this site follows the same constraint logic I use to architect a database migration.\n\nIt's all building. The materials change. The discipline doesn't."
    },
    "three-systems": {
      "id": "02",
      "slug": "three-systems",
      "title": "Three Systems: Narrative, Visual, Technical",
      "type": "page",
      "layout": "about-page",
      "navigation": true,
      "order": 2,
      "content": "# Three Systems\n\nThe work produces three kinds of output. Not departments. Not roles. Output channels through a single foundational discipline: Visual Communication.\n\nTypography is the chassis. Hierarchy is the load path. Everything else builds on top.\n\n## 1. Narrative Systems\n\nBrand story. Strategic positioning. World-building. **Narrative Solvency** — the infrastructure that ensures a narrative holds together when it moves from concept to deployment.\n\nThis isn't copywriting. It's structural integrity of the story itself. The brand's \"why\" gets encoded into the UX architecture, the design system, the technical logic. It survives constraint because it's load-bearing, not decorative.\n\n**The Problem:** Most brands lose their story when execution hits constraints. The messaging doesn't match the experience. The positioning fractures across touchpoints.\n\n**The Solution:** Encode narrative logic into operational systems. In Aiden Jae, \"accessible luxury\" isn't a tagline — it's baked into photography, Shopify UX, product grid logic. In Altrueism, \"radical transparency\" drives the information architecture and visual hierarchy. In New City, a knowledge graph holds the narrative. The story is the system.\n\n**When It Works:** Companies hiring \"brand storytellers\" at $200k+ aren't looking for copywriters. They need someone who can build the narrative infrastructure — the systems that ensure the story doesn't break when it hits technical reality. That's Narrative Systems.\n\n**Examples:** Aiden Jae, Altrueism, Everyday Gold, New City, Order of the Aetherwright, Modernist Homestead\n\n---\n\n## 2. Visual Systems\n\nIdentity. Typography. Design systems. The visual language that makes a brand or world coherent across contexts.\n\nThis is where the SVA lineage shows up directly. Swiss grid systems. Typographic hierarchy as information architecture. Visual form as load-bearing structure. Every project uses some form of Visual Systems — from Aiden Jae's luxury brand identity to The Deep Cuts' high-density concert posters to Encore's 12-year design system.\n\n**The Discipline:** Visual Systems answer \"How does the eye parse this?\" Whether it's regulatory constraints as design material (Everyday Gold), a format-locked visual archive (Photogeography), or a parametric typographic system (Versagrams), the work treats visual form as structural logic, not decoration.\n\n**The Foundation:** This sits directly on top of Visual Communication discipline. The same principles that held a 10,000-sheet print run hold a 12-year enterprise system. Precision. Constraint. Load paths. Visual coherence under pressure.\n\n**Examples:** Aiden Jae, The Deep Cuts, Versagrams, Encore, Photogeography, Echo & Bone, Everyday Gold\n\n---\n\n## 3. Technical Systems\n\nEngineering. UX architecture. Platforms. Infrastructure. The code and systems that make it actually work.\n\nThis is the \"full-stack engineering\" half. Encore: 12 years, 40K+ users, 99.9% uptime. Savepoint Protocol: CLI tool for cognitive scaffolding. Portable Agency: homelab infrastructure. Modernist Homestead: household operational systems. MathOnTape: signal flow protocols applied to music.\n\n**The Approach:** Technical Systems aren't isolated from Narrative and Visual. They're co-designed. The brand story informs the UX logic. The typographic system constrains the component library. The technical constraints shape the narrative. When all three systems work together, the result is **granular fidelity** — the idea and the infrastructure are the same thing.\n\n**Examples:** Encore, Savepoint Protocol, Portable Agency, Modernist Homestead, AI DevOps Workbench, MathOnTape\n\n---\n\n## Narrative Solvency\n\nThe term matters. Companies hiring \"brand storytellers\" don't just need someone who can write compelling copy. They need someone who can build the **narrative infrastructure** — the systems that ensure the story doesn't break when it moves from strategy to deployment.\n\nThat's the intersection of all three systems:\n- **Narrative** (the story logic)\n- **Visual** (the identity expression)\n- **Technical** (the engineering implementation)\n\nWorking together to create brands and products where the intent survives execution.\n\n**Proof:** Aiden Jae. Altrueism. Everyday Gold. Modernist Homestead. These aren't just \"designed\" — they're **narratively engineered**. The story is load-bearing."
    }
  },
  "contact": {
    "email": "peter@petersalvato.com",
    "links": [
      {
        "title": "GitHub",
        "url": "https://github.com/petersalvato"
      },
      {
        "title": "LinkedIn",
        "url": "https://linkedin.com/in/petersalvato"
      }
    ]
  },
  "legend": [
    {
      "tier": "Protocols",
      "color": "red",
      "altitude": 1,
      "description": "Decision-making frameworks. How the work gets built. Version control for intent."
    },
    {
      "tier": "Applied Systems",
      "color": "blue",
      "altitude": 2,
      "description": "Work deployed under constraint. Enterprise, commercial, personal. The proof the framework holds."
    },
    {
      "tier": "Practice",
      "color": "green",
      "altitude": 3,
      "description": "Active research. Stress-testing principles at low stakes. The laboratory."
    }
  ]
}
